# 팬더스, 데이터프레임, 시리즈 알아보기

In [1]:
import pandas as pd

In [15]:
data_frame = pd.read_csv('data-01-test-score.csv')

In [16]:
data_frame

    exam1  exam2  exam3  total
0      73     80     75    152
1      93     88     93    185
2      89     91     90    180
3      96     98    100    196
4      73     66     70    142
5      53     46     55    101
6      69     74     77    149
7      47     56     60    115
8      87     79     90    175
9      79     70     88    164
10     69     70     73    141
11     70     65     74    141
12     93     95     91    184
13     79     80     73    152
14     70     73     78    148
15     93     89     96    192
16     78     75     68    147
17     81     90     93    183
18     88     92     86    177
19     78     83     77    159
20     82     86     90    177
21     86     82     89    175
22     78     83     85    175
23     76     83     71    149
24     96     93     95    192

In [17]:
data_frame.head(2)

   exam1  exam2  exam3  total
0     73     80     75    152
1     93     88     93    185

In [18]:
data_frame.tail(2)

    exam1  exam2  exam3  total
23     76     83     71    149
24     96     93     95    192

In [20]:
type(data_frame.exam1)

pandas.core.series.Series

In [21]:
list_tmp = [1,2,3]

In [22]:
list_tmp

[1, 2, 3]

In [28]:
s1 = pd.core.series.Series([1,2,3,4])

In [29]:
s2 = pd.core.series.Series(['one','two','three'])

In [30]:
#여러개의 series중에 갯수가 가장 많은 값을 기준으로 하고,
#나머지 series의 값에는 'NaN'으로 들어간다.
pd.DataFrame(data = (dict(num=s1, word=s2)))

   num   word
0    1    one
1    2    two
2    3  three
3    4    NaN